Revit 2026 API

# AssetPropertyList Class

---

Represents a list of AssetProperty(s).

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetPropertyList

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetPropertyList : AssetProperty
```
```vb
Public Class AssetPropertyList
	Inherits AssetProperty
```
```cpp
public ref class AssetPropertyList : public AssetProperty
```
```fsharp
type AssetPropertyList =
    class
        inherit AssetProperty
    end
```

The AssetPropertyList type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified. (Inherited from AssetProperty) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssetProperty) |
|  | Name | Get the name of the AssetProperty(Inherited from AssetProperty) |
|  | NumberOfConnectedProperties | The number of currently connected properties. (Inherited from AssetProperty) |
|  | Type | Returns the type of the AssetProperty(Inherited from AssetProperty) |

|  | Name | Description |
| --- | --- | --- |
|  | AddConnectedAsset | Adds a new connected asset attached to this asset property, if it allows it. (Inherited from AssetProperty) |
|  | AddCopyAsConnectedAsset | Makes a copy of the asset and connects it to this property. (Inherited from AssetProperty) |
|  | AddNewAssetAsColor | Adds a new AssetPropertyDouble4 property to the list containing a value matching the input color. |
|  | AddNewAssetPropertyDouble | Adds a new AssetPropertyDouble containing the input value to this list. |
|  | AddNewAssetPropertyInteger | Adds a new AssetPropertyInteger containing the input value to this list. |
|  | Dispose | (Inherited from AssetProperty) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAllConnectedProperties | Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime. (Inherited from AssetProperty) |
|  | GetConnectedProperty | Gets one connected property with specified index. (Inherited from AssetProperty) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSingleConnectedAsset | Gets the single connected asset attached to this asset property, if it exists. (Inherited from AssetProperty) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetValue | Gets a collection of properties stored in this property list. These properties are copied. |
|  | InsertNewAssetAsColor | Insert a new AssetPropertyDouble4 containing the input value to this list. |
|  | InsertNewAssetPropertyDouble | Inserts a new AssetPropertyDouble containing the input value to this list. |
|  | InsertNewAssetPropertyInteger | Insert a new AssetPropertyInteger containing the input value to this list. |
|  | IsEditable | Check if property can be edited. (Inherited from AssetProperty) |
|  | IsValidSchemaIdentifier | Check that schema name is valid (Inherited from AssetProperty) |
|  | IsValidValue |  |
|  | RemoveAssetProperty | Remove the AssetProperty from the list. |
|  | RemoveConnectedAsset | Removes the connected asset attached to this asset property if any. (Inherited from AssetProperty) |
|  | SetValue |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Visual Namespace